Bismillah Her Hayrın Başıdır...

In [15]:
import pandas as pd
import numpy as np
import seaborn as sns

In [16]:
df = pd.read_csv("C:/Users/simurg/Veri analizi/avocado.csv")

In [32]:
df = df.select_dtypes(include = ['float64','int64'])
df = df.dropna()
df.head(5)

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,2015
1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,2015
2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,2015
3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,2015
4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,2015

In [26]:
df_table= df["Total Volume"]

In [28]:
df_table.head()

0     64236.62
1     54876.98
2    118220.22
3     78992.15
4     51039.60
Name: Total Volume, dtype: float64

In [77]:
df_table.mean()

Total Volume    850644.013009
dtype: float64

In [33]:
Q1 = df_table.quantile(0.25)
Q3 = df_table.quantile(0.75)
IQR = Q3 - Q1

In [35]:
Q1

10838.58

In [36]:
Q3

432962.29

In [37]:
IQR

422123.70999999996

In [39]:
alt_limit = Q1 -1.5*IQR 
üst_limit = Q3 +1.5*IQR

In [40]:
alt_limit

-622346.985

In [41]:
üst_limit

1066147.855

In [42]:
tf = df_table < alt_limit # alt sınırın aşağısından olan değerler...

In [44]:
tf.head()

0    False
1    False
2    False
3    False
4    False
Name: Total Volume, dtype: bool

In [45]:
tf1 = df_table > üst_limit # üst sınırın aşağısından olan değerler...

In [47]:
tf1.head()

0    False
1    False
2    False
3    False
4    False
Name: Total Volume, dtype: bool

In [49]:
ad = (df_table < alt_limit) | (df_table >üst_limit)

In [51]:
ad.head()

0    False
1    False
2    False
3    False
4    False
Name: Total Volume, dtype: bool

In [52]:
tf.head()

0    False
1    False
2    False
3    False
4    False
Name: Total Volume, dtype: bool

In [54]:
df_table[tf].head() # alt sınırın aşağısında hiç bir değer yok!

Series([], Name: Total Volume, dtype: float64)

In [56]:
df_table[tf1].head() # üst sınırın yukarında ki değerler...

0    5040365.47
1    4695737.21
2    5259354.30
3    5775536.27
4    4575710.62
Name: Total Volume, dtype: float64

# Aykırı Değer problemlerini çözme


# SİLME

In [57]:
type(df_table)

pandas.core.series.Series

In [62]:
import pandas as pd

In [63]:
df_table = pd.DataFrame(df_table)

In [64]:
df_table.shape

(18249, 1)

In [67]:
t_df = df_table [~((df_table < (alt_limit)) | (df_table >(üst_limit))).any(axis= 1)]

In [69]:
t_df.shape

(15952, 1)

In [70]:
# t_df; bu bizim aykırı değerleri sildikten sonraki verilerimiz...

#Aykırıları ortalama ile dolduracağız...

In [72]:
df_table[tf]

Empty DataFrame
Columns: [Total Volume]
Index: []

In [74]:
df_table[tf1].head()

   Total Volume
0    5040365.47
1    4695737.21
2    5259354.30
3    5775536.27
4    4575710.62

In [86]:
df_table.mean()

Total Volume    850644.013009
dtype: float64

In [87]:
df_table[tf1] = 850644.013009

In [89]:
df_table[tf1]

     Total Volume
0   850644.013009
1   850644.013009
2   850644.013009
3   850644.013009
4   850644.013009
5   850644.013009
6   850644.013009
7   850644.013009
8   850644.013009
9   850644.013009
10  850644.013009
11  850644.013009
12  850644.013009
13  850644.013009
14  850644.013009
15  850644.013009
16  850644.013009
17  850644.013009
18  850644.013009
19  850644.013009
20  850644.013009
21  850644.013009
22  850644.013009
23  850644.013009
24  850644.013009
25  850644.013009
26  850644.013009
27  850644.013009
28  850644.013009
29  850644.013009
..            ...
28  850644.013009
29  850644.013009
30  850644.013009
31  850644.013009
32  850644.013009
33  850644.013009
34  850644.013009
35  850644.013009
36  850644.013009
37  850644.013009
38  850644.013009
39  850644.013009
40  850644.013009
41  850644.013009
42  850644.013009
43  850644.013009
44  850644.013009
45  850644.013009
0   850644.013009
1   850644.013009
2   850644.013009
3   850644.013009
4   850644.013009
5   850644.013009
6   850644.013009
7   850644.013009
8   850644.013009
9   850644.013009
10  850644.013009
11  850644.013009

[2297 rows x 1 columns]

In [90]:
##Baskılama Yöntemi

In [91]:
# Burada altsınıra yakın verileri altsınıra, üstsınıra yakın yerleri üstsınıra eşitler...

In [92]:
df = df.select_dtypes(include = ['float64','int64'])
df = df.dropna()
df.head(5)

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,2015
1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,2015
2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,2015
3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,2015
4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,2015

In [94]:
df_table = df["Total Volume"]

In [96]:
df_table.head()

0     64236.62
1     54876.98
2    118220.22
3     78992.15
4     51039.60
Name: Total Volume, dtype: float64

In [97]:
alt_limit

-622346.985

In [98]:
df_table[tf]=alt_limit

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [99]:
df_table[tf]

Series([], Name: Total Volume, dtype: float64)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
      ...
6     False
7     False
8     False
9     False
10    False
11    False
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: Total Volume, Length: 18249, dtype: bool

In [101]:
üst_limit

1066147.855

In [102]:
df_table[tf1]=üst_limit

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [104]:
df_table[tf1]

0     1066147.855
1     1066147.855
2     1066147.855
3     1066147.855
4     1066147.855
5     1066147.855
6     1066147.855
7     1066147.855
8     1066147.855
9     1066147.855
10    1066147.855
11    1066147.855
12    1066147.855
13    1066147.855
14    1066147.855
15    1066147.855
16    1066147.855
17    1066147.855
18    1066147.855
19    1066147.855
20    1066147.855
21    1066147.855
22    1066147.855
23    1066147.855
24    1066147.855
25    1066147.855
26    1066147.855
27    1066147.855
28    1066147.855
29    1066147.855
         ...
28    1066147.855
29    1066147.855
30    1066147.855
31    1066147.855
32    1066147.855
33    1066147.855
34    1066147.855
35    1066147.855
36    1066147.855
37    1066147.855
38    1066147.855
39    1066147.855
40    1066147.855
41    1066147.855
42    1066147.855
43    1066147.855
44    1066147.855
45    1066147.855
0     1066147.855
1     1066147.855
2     1066147.855
3     1066147.855
4     1066147.855
5     1066147.855
6     1066147.855
7     1066147.855
8     1066147.855
9     1066147.855
10    1066147.855
11    1066147.855
Name: Total Volume, Length: 2297, dtype: float64